{"irVersion":7,"opsetVersion":13,"producerName":"HAJIMI-ALICE-ML","producerVersion":"1.0.0","graph":{"name":"alice_behavior_classifier","inputs":[{"name":"input","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":-1},{"dimValue":12}]}}}}],"outputs":[{"name":"output","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":-1},{"dimValue":6}]}}}}],"nodes":[{"opType":"MatMul","inputs":["input","W0"],"outputs":["matmul0"]},{"opType":"Add","inputs":["matmul0","b0"],"outputs":["add0"]},{"opType":"Relu","inputs":["add0"],"outputs":["relu0"]},{"opType":"MatMul","inputs":["relu0","W1"],"outputs":["matmul1"]},{"opType":"Add","inputs":["matmul1","b1"],"outputs":["add1"]},{"opType":"Relu","inputs":["add1"],"outputs":["hidden_out"]},{"opType":"MatMul","inputs":["hidden_out","W_out"],"outputs":["matmul_out"]},{"opType":"Add","inputs":["matmul_out","b_out"],"outputs":["logits"]},{"opType":"Softmax","inputs":["logits"],"outputs":["output"],"attributes":{"axis":1}}],"initializers":[{"name":"W0","dataType":"INT8","dims":[64,12],"data":[-112,-114,49,0,105,-128,-114,62,-103,-59,101,0,70,0,0,-81,92,99,-66,-89,51,0,116,0,-71,111,-113,115,0,115,97,0,60,120,-126,-83,0,0,100,101,121,-74,-110,-122,-52,-113,0,-110,-72,0,43,-118,-112,118,0,41,0,-41,64,0,98,-87,0,0,0,85,0,86,0,-87,0,-118,-86,-79,0,-66,91,-123,0,0,-103,0,0,67,-128,-94,0,-98,0,0,-54,96,49,-104,69,0,43,92,55,61,40,0,-105,0,0,0,0,-117,0,126,-82,103,0,-122,-86,0,116,-93,-127,49,-49,-58,61,103,-111,42,97,0,101,-57,61,-83,71,0,113,0,67,88,102,0,101,82,-97,107,-110,0,0,56,87,111,0,-60,120,110,-68,82,49,57,0,0,-78,-92,0,91,0,-43,-86,0,0,-55,47,41,-45,-110,-53,0,0,0,122,-53,-54,0,80,117,-111,0,114,0,0,57,60,112,84,117,95,-64,-43,-47,-105,-117,0,-57,67,0,-77,0,92,58,-98,120,-118,57,-110,0,-98,-55,0,115,113,57,97,0,69,126,0,95,-46,0,-63,-56,-117,-72,-55,108,-98,-95,89,61,-65,-103,101,0,-78,-51,102,43,102,-68,0,123,121,0,0,-66,125,-110,0,41,0,0,53,93,-61,-57,68,0,0,51,76,-97,0,62,-126,-83,-128,-74,0,-70,0,-120,0,-83,-41,-126,63,0,0,0,-91,-92,0,0,80,-79,-116,0,-57,-40,0,-80,-72,0,61,0,-101,-55,0,0,50,0,65,50,-59,-81,0,81,0,56,-105,0,0,113,0,79,46,0,0,0,89,61,0,92,0,0,0,46,44,99,-43,-96,0,0,0,113,-92,-71,-110,-128,-77,-42,-118,-77,0,90,-48,-59,96,-81,-101,-51,0,-100,52,-87,103,-49,-53,-105,-64,-55,0,-73,-75,47,-117,0,0,70,127,110,-83,-116,0,104,-79,0,0,-66,0,-83,81,0,40,-59,0,72,-79,-95,0,0,-113,71,0,-43,0,54,-98,74,-82,102,-101,96,0,0,0,95,-85,-71,105,-71,52,0,-89,-56,-117,0,-111,44,-85,-82,0,-74,60,0,-109,55,-107,-74,0,-113,-74,0,-78,0,127,-99,93,-114,0,-42,-125,106,0,117,48,-121,116,71,66,-71,-106,-87,77,90,0,-125,48,-106,99,0,-62,41,72,67,-89,-80,-103,103,58,-79,59,0,0,0,-94,0,97,59,0,0,-42,0,-57,-68,120,-118,-92,119,88,0,-70,109,45,54,92,-109,-94,-61,0,0,0,76,-102,0,0,0,-112,50,-77,-54,93,0,-115,0,-66,44,-67,0,127,89,83,-85,-64,-119,47,-92,-64,-61,89,-66,85,-90,0,42,-53,-81,0,-60,53,-82,110,92,-53,77,82,94,0,117,68,-74,-121,108,-69,45,-123,64,80,0,-77,0,119,-100,63,-80,-108,78,0,0,0,-95,46,0,0,101,55,89,101,-117,-73,121,0,0,0,0,67,0,0,-127,114,-44,0,109,0,0,0,56,0,75,-82,-69,0,0,0,70,0,123,0,-107,96,83,75,-106,0,91,126,89,49,-87,0,-76,-106,0,-56,-118,0,-84,0,0,0,126,0,43,0,96,0,-50,0,0,84,-120,0,-63,0,112,0,-44,-61,0,-114,0,0,0,0,-75,110,0,-56,-87,0,76,0,-65,0,-115,77,-46,127,0,0,68,104,0,124,-46,50,0,-95,-70,-48,-68,-74,-91,-63,-127,-62,0,-113,-118,57,82,0,78,-122,106,111,109,-42,90,113,-88,0,93,120,115,0,0,106,-74,57,-122,119,-109,-112,0,-112,0,0,-57,0,-42,-97,0,61,70,96,49,-64,0,0,87,0,-102,0,87,0,69,0,0,0,0,109,0,62,111,71,102,86,0,-52,-46,0,57,101,41,-57,0,0,58]},{"name":"b0","dataType":"INT8","dims":[64],"data":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},{"name":"W1","dataType":"INT8","dims":[32,64],"data":[-82,-51,-64,-1,-1,100,-62,-52,62,123,42,-72,56,-1,-1,54,-1,-1,126,-1,47,47,-1,-94,-63,-1,-1,-1,-1,-1,-65,49,-66,66,-86,87,-1,-92,48,-126,-1,-117,-1,-52,-1,-95,-93,86,-1,-1,80,62,59,-1,-1,42,57,-1,80,50,-1,-110,-124,53,-121,-91,-1,-1,-1,-109,-80,-1,-1,-1,-124,-55,-46,-1,-115,-86,76,-1,107,-60,-1,-48,-110,-1,-56,101,-60,-82,-49,76,-1,-60,104,117,55,62,-1,-1,80,40,49,-88,-76,-67,54,92,70,-1,-1,-1,-1,57,-108,-80,-1,-67,106,-64,-94,110,89,78,-1,125,-70,-1,-105,67,-1,95,-101,-1,-1,-128,-52,92,-1,-1,106,-1,81,-1,71,-1,-1,-1,106,90,113,113,-1,-52,112,-88,-72,-61,51,-82,-112,-76,71,-99,-1,-101,110,-122,118,43,108,-1,-84,-1,88,-46,61,40,104,-1,124,115,50,41,-104,81,-60,-1,-1,-52,-89,122,-1,-1,-95,-1,-1,-1,81,-48,-1,-81,94,-1,122,-1,105,91,-1,-1,55,-1,-103,-45,60,-1,95,-1,-1,111,-1,-88,-113,-1,96,-1,93,114,-73,105,-1,-78,83,-119,-105,-65,-1,-1,-59,-1,-76,-77,-120,-1,-58,84,-1,47,-1,73,-44,-51,-1,50,79,48,87,-118,-1,93,69,66,102,40,-54,81,-53,-90,-41,-67,-1,-1,-1,124,-1,89,-70,124,-112,-55,-1,-71,-1,91,-57,-123,-1,97,-114,-1,85,-83,103,93,-1,-1,108,-117,-1,-1,-1,-1,-61,-1,62,-1,-1,-69,107,87,67,-52,56,-109,-114,110,-1,96,-88,119,-76,-1,-1,-1,61,-1,-79,97,-1,-1,-97,-45,84,-1,-67,-73,-1,114,89,-1,126,-1,55,-1,96,-94,103,-1,-113,-1,-1,-46,-61,117,113,43,-1,-50,98,-120,-1,-75,-114,-1,125,85,-49,-108,-1,124,-1,78,54,-115,-104,-117,-100,55,-64,88,110,-72,90,-63,-1,-1,118,-1,-72,97,125,124,-1,-121,-1,-120,117,75,-65,-1,-70,-1,-125,104,-1,-112,-1,-69,-1,-1,-42,-58,51,53,109,-125,-55,127,-56,106,-126,120,62,87,-110,62,-63,-84,-1,-1,-97,60,103,98,-1,-1,102,-92,-54,-1,-107,110,-1,-1,-59,-77,-1,-125,-1,-91,-49,-126,110,-1,-54,-56,70,-1,108,47,49,126,-76,-118,-1,56,-1,56,-1,-1,89,-1,-123,-1,-1,83,-1,86,-1,62,-56,-1,46,-63,-91,51,125,53,-83,-1,-1,-77,126,-97,106,110,64,-1,-93,83,-1,-1,-78,-1,-1,103,114,-60,-82,-62,99,71,-73,-82,-95,-46,-1,-1,-59,46,-1,-87,-60,-84,-1,-126,-47,117,122,121,104,75,80,-1,-41,-80,-110,-1,118,-78,-124,-1,-1,-56,-52,71,-1,-1,-1,-1,100,-1,120,-121,-116,-1,62,83,108,-41,-58,-55,-110,-1,47,-1,-1,93,84,-1,-90,96,-86,-50,-1,-119,-61,111,-1,-1,58,92,-1,-41,-1,-116,-1,96,-119,95,-49,124,-1,122,52,89,-86,-105,84,-1,-1,-1,-128,-1,-1,81,-1,-69,-1,118,-1,-1,-1,51,-1,-128,-84,125,-1,40,-60,80,95,-42,-1,-70,122,-69,-96,-128,-73,-75,-1,-109,-1,-100,-45,111,-1,-1,-94,115,68,51,-81,-1,-43,59,42,111,-115,-1,-1,42,54,-1,-128,-1,124,96,-89,112,-1,-79,-1,72,-1,-1,90,-1,-123,-80,51,-114,-64,-1,-51,-57,-70,-1,94,-56,88,-1,-1,-1,-121,-117,61,-1,-111,-59,-1,-1,-56,-121,-98,-1,-87,-1,80,-1,103,-71,-1,-1,59,-83,40,76,-103,-62,-77,-1,56,-126,-80,-1,114,-1,-41,-104,-122,-58,-1,120,116,49,90,-1,86,-1,-1,-1,-72,-1,-47,44,-104,-91,121,-1,-66,56,-82,-1,88,-77,-86,-1,99,48,105,63,-110,-52,58,50,-109,-1,-1,-1,-1,-77,-80,-116,-41,-1,-1,-49,-1,-1,-1,-1,95,40,53,-86,-51,-73,-92,125,-111,61,-47,-80,-85,-84,110,79,99,84,83,76,80,43,40,-111,-1,-1,-1,65,-1,46,-114,-1,-1,106,112,-82,-1,-1,-84,-60,109,-1,-1,-1,-107,-1,126,-1,-49,-49,-1,94,59,108,-1,-1,56,-1,77,-102,55,-1,-1,-51,-124,-61,118,-123,-1,-84,66,-1,-60,63,-112,-110,-1,44,-104,-1,94,99,-49,-63,71,104,-1,-110,41,-53,83,-1,73,-104,-102,-65,-1,98,42,-1,73,51,116,-99,-1,77,-1,-1,82,-1,40,-1,-44,-1,-1,-46,82,-1,-1,-109,83,-1,-1,-124,-70,-1,58,-1,-1,104,-82,100,-1,71,-110,-67,-45,63,-119,-62,-72,-47,-1,-85,-126,44,-92,117,-84,-98,59,-1,113,-116,-65,48,-51,-70,-109,-1,-121,44,-79,-99,-83,-73,69,-1,-1,-1,-86,-60,-120,-1,-1,-1,-1,-104,48,45,54,53,118,-75,-1,-123,-44,-55,-77,43,-1,-1,-43,102,-1,-93,112,-1,-71,-60,-51,-119,-1,-90,-69,110,-61,-70,-1,66,-126,-1,-1,124,-96,-1,-1,-1,108,-120,-1,106,98,57,110,-1,119,-47,124,110,-80,-1,-79,101,-102,-48,51,115,-74,-56,-1,-1,-45,-105,-51,-1,-1,101,89,91,-84,-44,67,-108,51,-57,-50,51,125,88,108,-121,-110,120,119,-1,-78,86,60,-1,-1,-98,-114,78,108,75,-82,67,-54,-1,93,-70,83,-1,102,-1,-110,95,-44,-106,-80,-1,-1,-1,-1,54,-119,-61,-67,-1,-105,-62,-1,-109,-1,-72,-1,-97,68,71,82,-63,-67,-1,-1,-1,61,40,-1,-92,-49,-102,43,-1,-1,-1,72,105,-117,-95,71,-1,83,56,-120,-41,91,-1,-54,106,111,-1,-121,97,-1,-87,-110,-1,-1,-1,-67,-1,69,-90,96,-1,-1,59,-1,-1,-47,103,-1,-54,86,75,46,-91,-1,-82,-117,-1,50,69,117,-1,75,89,-1,-105,-1,-1,49,67,86,-104,124,-102,46,-1,-82,-113,-49,-47,-110,-1,72,-62,-110,41,-90,-65,-1,119,-59,-1,120,-89,-1,-1,-100,64,111,-71,-1,45,-78,67,-100,47,47,120,94,43,-90,-1,-112,117,67,-1,-110,-1,-85,-1,112,119,71,100,43,-1,-45,61,54,-87,-1,112,-105,-1,108,120,48,-1,114,-1,-117,-1,-1,60,-56,120,-1,-1,-1,-1,-121,44,53,-1,-86,-93,-48,-1,127,-1,-46,-1,83,93,52,-89,119,-1,112,-1,-1,-1,-84,75,95,-94,64,108,-1,45,-1,57,41,61,89,-1,-67,-1,42,125,-81,-89,-52,-1,42,100,-103,104,-90,-1,-1,-1,-115,-100,-1,-45,91,46,-1,-1,66,-72,102,-1,-70,-1,-1,72,-63,-78,-45,-1,104,-46,119,122,83,-111,-125,63,-47,-86,-74,64,110,-1,-68,-1,-1,-51,-1,-1,-1,-49,-1,92,113,-1,-53,118,-100,-1,71,-1,-88,43,-104,127,-1,-64,41,-108,124,117,-1,-1,-45,58,-43,125,-68,67,92,-1,62,-99,-1,102,72,64,-80,-102,-1,-109,52,75,75,-55,-120,-1,81,79,115,65,-1,93,-69,-1,-1,-53,-1,-63,-88,-118,-40,69,-1,-1,-48,-77,-1,49,-103,107,-112,76,106,124,40,-1,-54,69,-119,117,-126,-1,123,-66,-1,-51,-45,-1,117,-115,-1,-1,-1,-1,-1,91,-73,89,-107,-73,-1,69,81,-95,57,-55,-1,123,63,-53,-81,75,-1,-1,-1,-1,122,122,-1,-74,-111,-65,57,96,-1,-1,41,121,-78,121,76,53,-1,-1,-46,-121,-1,-117,-84,-81,66,-47,48,120,-45,89,-1,73,-107,60,-54,-1,63,-44,50,-1,49,-74,-110,74,-43,-1,-1,87,-1,-1,-1,-63,-1,-1,-1,103,-96,120,-103,125,43,-1,104,-125,42,105,-1,-1,67,-1,78,-1,-1,-1,-1,-1,-115,-115,64,118,-77,46,-1,-103,-1,-87,78,-1,-1,-98,-1,-1,94,-1,-53,-1,75,113,-45,102,84,90,-1,-1,-115,-72,-1,-120,-98,-1,40,115,-1,-127,-57,57,55,-1,52,-124,-1,77,126,-114,114,-128,-95,105,-56,72,78,-1,-121,-80,-47,58,-1,-1,73,91,-97,-1,77,-70,84,-1,63,-1,70,-96,-122,110,-1,-66,78,-103,-1,-124,57,-1,-1,106,-88,73,114,48,-85,106,-1,-1,64,-80,-46,-106,84,-1,117,87,126,-105,-60,-44,82,-117,108,88,-61,98,92,64,-64,92,91,-55,96,-1,-1,-61,93,99,-1,-1,-100,-1,-53,-107,54,-111,116,101,-1,-61,-1,-1,119,-1,-93,117,78,-1,82,-1,-1,-75,94,-46,107,102,58,-75,44,68,116,84,61,-45,-81,-87,79,59,-1,-1,-56,-79,93,-1,-99,-70,111,-114,103,-1,-83,42,-83,-1,107,-114,63,-1,74,77,-1,-1,109,-45,-71,-69,101,-1,-107,-76,-1,-1,-1,-1,-71,63,58,96,100,-1,-73,48,-69,56,78,-1,-1,98,77,-1,-112,52,-75,63,-46,-1,80,81,-1,-1,54,111,-91,123,95,-46,40,-108,96,120,-104,-48,-49,116,118,-92,68,51,70,121,74,116,120,-83,-70,55,54,-1,104,-118,-1,-1,-1,-1,99,52,77,-83,-74,-92,80,-88,-1,-1,-77,-67,-1,69,103,-49,-66,54,-1,-126,84,-87,94,114,-98,-123,79,-69,102,41,-60,51,73,-112,-63,-55,74,-1,-116,66,47,-68,65,-60,-77,-1,-65,-1,-1,65,-1,-51,50,78,-1,-79,104,-1,61,-97,86,-47,-1,118,-1,-106,-1,-59,-1,-1,-1,-1,-1,-1,51,-1,-1,110,-1,-105,86,-47,-49,-84,-70,-115,-92,-101,54,50,-1,88,-111,-1,86,-1,-74,103,-64,98,-1,103,-1,120,-1,45,-1,78,48,-1,-1,-90,40,-106,-1,-121,-1,-1,98,-68,-1,121,-58,-1,-127,60,83,-1,66,-1,73,58,-1,-1,-68,-1,-107,-1,-61,-71,75,-119,87,-105,74,102,78,-1,-109,46,-103,-1,-1,78,-45,65,40,-1,-56,-45,71,-1,-1,-1,120,-88,119,-42,-117,-1,-116,-1,56,-114,77,-42,-53,-1,-1,-97,56,67,-1,47,-1,-1,-62,-1,-64,76,-66,89,73,61,44,-89,120,-44,74,-1,-1,-127,-115,-1,-116,-1,101,116,114,-79,-1,-1,-46,-46,45,86,97,77,-1,-1,-44,-49,-1,-1,52,61,-45,113,-1,52,-1,103,-1,-73,67,41,-42,-64,-83,-88,78,-1,-1,-100,-104,-61,-73,55,-1,-1,-72,-1,85,-1,56,58,55,-1,82,69,-1,40]},{"name":"b1","dataType":"INT8","dims":[32],"data":[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null]},{"name":"W_out","dataType":"INT8","dims":[6,32],"data":[-1,-54,-50,-1,103,70,92,-122,-1,-1,-1,-53,-1,92,76,-1,-1,-84,86,-1,-1,105,-1,125,-57,-85,-104,-1,-56,-49,111,45,80,-1,106,43,114,63,-1,83,-1,-1,62,43,-114,-72,-57,-1,-69,-100,-100,-1,48,-123,75,-1,53,119,-1,-1,46,-78,125,127,-115,-115,53,-115,-75,-1,85,79,-1,-108,-54,-109,-121,-97,-91,100,-78,95,-1,-58,-70,-1,46,54,-93,-102,-1,-1,48,-1,60,-65,83,82,-1,-1,64,112,-1,124,92,-68,93,-59,-52,-1,44,-1,-58,57,-107,85,101,95,-1,77,48,-1,-1,63,65,-119,55,-1,115,-1,-1,-1,-93,107,-1,-1,60,-1,70,-128,-1,67,-67,-119,-1,-71,-1,67,59,58,-1,-1,-127,-71,-111,-51,-1,46,-1,-101,-78,-1,69,114,-113,66,87,52,93,109,-75,-56,-81,-1,-66,118,-93,-1,-1,109,-124,87,-117,-1,70,91,81,-1,-1,-79,-72,-94]},{"name":"b_out","dataType":"INT8","dims":[6],"data":[null,null,null,null,null,null]}]}}